
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_bigquery_dataset.billing_dataset will be created
  + resource "google_bigquery_dataset" "billing_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "billing_data"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + friendly_name              = "GCP Billing Data"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + labels                     = (known after apply)
      + last_modified_time         = (known after apply)
      + max_time_travel_hours      = (known after apply)
      + project                    = "prj-c-billing-logs-j082"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + routine {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + routine_id = (known after apply)
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_project_iam_member.project_scc_default_service_account["roles/artifactregistry.writer"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/cloudfunctions.serviceAgent"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/cloudfunctions.serviceAgent"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.project_scc_default_service_account["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "project_scc_default_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/storage.objectViewer"
    }

  # google_pubsub_subscription.scc_notification_subscription will be created
  + resource "google_pubsub_subscription" "scc_notification_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "sub-scc-notification"
      + project                    = "prj-c-scc-mdzj"
      + topic                      = "top-scc-notification"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # google_pubsub_topic.scc_notification_topic will be created
  + resource "google_pubsub_topic" "scc_notification_topic" {
      + id      = (known after apply)
      + name    = "top-scc-notification"
      + project = "prj-c-scc-mdzj"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_scc_notification_config.scc_notification_config will be created
  + resource "google_scc_notification_config" "scc_notification_config" {
      + config_id       = "false"
      + description     = "SCC Notification for all active findings"
      + id              = (known after apply)
      + name            = (known after apply)
      + organization    = "252632484771"
      + pubsub_topic    = (known after apply)
      + service_account = (known after apply)

      + streaming_config {
          + filter = "state = \"ACTIVE\""
        }
    }

  # module.cai_monitoring.data.archive_file.function_source_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "function_source_zip" {
      + excludes            = [
          + "package-lock.json",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/cai-monitoring/cai_monitoring.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/cai-monitoring/function-source/"
      + type                = "zip"
    }

  # module.cai_monitoring.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-scc-mdzj"
      + skip_delete         = (known after apply)
    }

  # module.cai_monitoring.data.google_storage_project_service_account.gcs_sa will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_project_service_account" "gcs_sa" {
      + email_address = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + project       = "prj-c-scc-mdzj"
    }

  # module.cai_monitoring.google_artifact_registry_repository.cloudfunction will be created
  + resource "google_artifact_registry_repository" "cloudfunction" {
      + create_time   = (known after apply)
      + description   = "This repo stores de image of the cloud function."
      + format        = "DOCKER"
      + id            = (known after apply)
      + kms_key_name  = (known after apply)
      + location      = "northamerica-northeast1"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = "prj-c-scc-mdzj"
      + repository_id = (known after apply)
      + update_time   = (known after apply)
    }

  # module.cai_monitoring.google_cloud_asset_organization_feed.organization_feed will be created
  + resource "google_cloud_asset_organization_feed" "organization_feed" {
      + asset_types     = [
          + ".*",
        ]
      + billing_project = "prj-c-scc-mdzj"
      + content_type    = "IAM_POLICY"
      + feed_id         = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + org_id          = "252632484771"

      + feed_output_config {
          + pubsub_destination {
              + topic = (known after apply)
            }
        }
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["artifactregistry"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["cloudfunctions"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["pubsub"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_kms_crypto_key_iam_member.encrypter_decrypter["storage"] will be created
  + resource "google_kms_crypto_key_iam_member" "encrypter_decrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cai_monitoring.google_organization_iam_member.cloudfunction_findings_editor will be created
  + resource "google_organization_iam_member" "cloudfunction_findings_editor" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + org_id = "252632484771"
      + role   = "roles/securitycenter.findingsEditor"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/eventarc.eventReceiver"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/eventarc.eventReceiver"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/pubsub.publisher"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/pubsub.publisher"
    }

  # module.cai_monitoring.google_project_iam_member.cloudfunction_iam["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "cloudfunction_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/run.invoker"
    }

  # module.cai_monitoring.google_project_service.services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "artifactregistry.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "cloudasset.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "cloudbuild.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudfunctions.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "cloudfunctions.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["eventarc.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "eventarc.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "pubsub.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["run.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "run.googleapis.com"
    }

  # module.cai_monitoring.google_project_service.services["storage.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "prj-c-scc-mdzj"
      + service            = "storage.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["artifactregistry"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = "prj-c-scc-mdzj"
      + service = "artifactregistry.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["cloudfunctions"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = "prj-c-scc-mdzj"
      + service = "cloudfunctions.googleapis.com"
    }

  # module.cai_monitoring.google_project_service_identity.service_sa["pubsub"] will be created
  + resource "google_project_service_identity" "service_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = "prj-c-scc-mdzj"
      + service = "pubsub.googleapis.com"
    }

  # module.cai_monitoring.google_scc_source.cai_monitoring will be created
  + resource "google_scc_source" "cai_monitoring" {
      + description  = "SCC Finding Source for caiMonitoring Cloud Functions."
      + display_name = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + organization = "252632484771"
    }

  # module.cai_monitoring.google_service_account.cloudfunction will be created
  + resource "google_service_account" "cloudfunction" {
      + account_id = "cai-monitoring"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "prj-c-scc-mdzj"
      + unique_id  = (known after apply)
    }

  # module.cai_monitoring.google_storage_bucket_object.cf_cai_source_zip will be created
  + resource "google_storage_bucket_object" "cf_cai_source_zip" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "../../modules/cai-monitoring/cai_monitoring.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "../../modules/cai-monitoring/cai_monitoring.zip"
      + storage_class  = (known after apply)
    }

  # module.cai_monitoring.random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.cai_monitoring.time_sleep.wait_for_bucket will be created
  + resource "time_sleep" "wait_for_bucket" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.cai_monitoring.time_sleep.wait_kms_iam will be created
  + resource "time_sleep" "wait_kms_iam" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.kms.google_kms_crypto_key.key[0] will be created
  + resource "google_kms_crypto_key" "key" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "key-cai-monitoring"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "7776000s"

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.kms.google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id       = (known after apply)
      + location = "northamerica-northeast1"
      + name     = "krg-cai-monitoring"
      + project  = "prj-c-scc-mdzj"
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member["resource"] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = "bkt-prj-c-logging-f907-org-logs-e8gm"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:service-folder-676704635797@gcp-sa-logging.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member_billing[0] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member_billing" {
      + bucket = "bkt-prj-c-logging-f907-org-logs-e8gm"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:service-b-01F01C-EC0BAC-DD9482@gcp-sa-logging.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # module.cai_monitoring.module.cloud_function.google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description = "Check on the Organization for members (users, groups and service accounts) that contains the IAM roles listed."
      + environment = (known after apply)
      + id          = (known after apply)
      + location    = "northamerica-northeast1"
      + name        = "caiMonitoring"
      + project     = "prj-c-scc-mdzj"
      + state       = (known after apply)
      + update_time = (known after apply)
      + url         = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "caiMonitoring"
          + environment_variables = (known after apply)
          + runtime               = "nodejs20"

          + source {

              + storage_source {
                  + bucket     = (known after apply)
                  + generation = (known after apply)
                  + object     = "../../modules/cai-monitoring/cai_monitoring.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.pubsub.topic.v1.messagePublished"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY"
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "northamerica-northeast1"
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "256M"
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 100
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 1
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 60
          + uri                              = (known after apply)
        }
    }

  # module.cai_monitoring.module.cloudfunction_source_bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "NORTHAMERICA-NORTHEAST1"
      + name                        = (known after apply)
      + project                     = "prj-c-scc-mdzj"
      + public_access_prevention    = "inherited"
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + autoclass {
          + enabled = false
        }

      + encryption {
          + default_kms_key_name = (known after apply)
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = true
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.cai_monitoring.module.pubsub_cai_feed.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-scc-mdzj"
      + skip_delete         = (known after apply)
    }

  # module.cai_monitoring.module.pubsub_cai_feed.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prj-c-scc-mdzj"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.cai_monitoring.module.pubsub_cai_feed.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id           = (known after apply)
      + kms_key_name = (known after apply)
      + name         = (known after apply)
      + project      = "prj-c-scc-mdzj"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.logs_export.module.destination_storage[0].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "bkt-prj-c-logging-f907-org-logs-e8gm"
      + project                     = "prj-c-logging-f907"
      + public_access_prevention    = "inherited"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = false
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.logs_export.module.destination_storage[0].google_storage_bucket_iam_member.storage_sink_member will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = "bkt-prj-c-logging-f907-org-logs-e8gm"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:service-folder-676704635797@gcp-sa-logging.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # module.scc_notifications.module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prj-c-scc-mdzj"
      + skip_delete         = (known after apply)
    }

  # module.scc_notifications.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01F01C-EC0BAC-DD9482"
      + display_name    = "Budget For prj-c-scc-mdzj"
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.scc_notifications.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01F01C-EC0BAC-DD9482"
      + folder_id           = "591265684075"
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-scc"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-c-scc"
      + number              = (known after apply)
      + project_id          = "prj-c-scc-mdzj"
      + skip_delete         = (known after apply)
    }

  # module.scc_notifications.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "prj-c-scc Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "prj-c-scc-mdzj"
      + unique_id    = (known after apply)
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "prj-c-scc-mdzj"
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "prj-c-scc-mdzj"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "prj-c-scc-mdzj"
      + service                    = "logging.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "prj-c-scc-mdzj"
      + service                    = "pubsub.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["securitycenter.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "prj-c-scc-mdzj"
      + service                    = "securitycenter.googleapis.com"
    }

Plan: 54 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cai_monitoring_artifact_registry = (known after apply)
  + cai_monitoring_asset_feed        = (known after apply)
  + cai_monitoring_bucket            = (known after apply)
  + cai_monitoring_topic             = (known after apply)
  + scc_notifications_project_number = (known after apply)

  ```

  </details>
  
  